dataset_gen/Earlier_Datasets/OpenFoam_Shapes/Rectangle/design_points/design_point_1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9600
(
(-8.0159284 -7.4652425 0.5)
(-7.76842 -7.4652425 0.5)
(-7.5209116 -7.4652425 0.5)
(-7.2734032 -7.4652425 0.5)
(-7.0258948 -7.4652425 0.5)
(-6.7783864 -7.4652425 0.5)
(-6.5308779 -7.4652425 0.5)
(-6.2833695 -7.4652425 0.5)
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(-4.1645143 -4.7100098 0.5)
(-4.1145143 -4.7100098 0.5)
(-4.0645143 -4.7100098 0.5)
(-4.0145143 -4.7100098 0.5)
(-3.9645143 -4.7100098 0.5)
(-3.9145143 -4.7100098 0.5)
(-3.8645143 -4.7100098 0.5)
(-3.8145143 -4.7100098 0.5)
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-8.0645143 -7.5 0.5)
(-7.8145143 -7.5 0.5)
(-7.5645143 -7.5 0.5)
(-7.3145143 -7.5 0.5)
(-7.0645143 -7.5 0.5)
(-6.8145143 -7.5 0.5)
(-6.5645143 -7.5 0.5)
(-6.3145143 -7.5 0.5)
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(1.6854857 7.5 0.5)
(1.4354857 7.5 0.5)
(1.1854857 7.5 0.5)
(0.93548569 7.5 0.5)
(0.68548569 7.5 0.5)
(0.43548569 7.5 0.5)
(0.18548569 7.5 0.5)
(-0.064514308 7.5 0.5)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(-15 7.3125 0.5)
(-15 6.9375 0.5)
(-15 6.5625 0.5)
(-15 6.1875 0.5)
(-15 5.8125 0.5)
(-15 5.4375 0.5)
(-15 5.0625 0.5)
(-15 4.6875 0.5)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(15 -7.3125 0.5)
(15 -6.9375 0.5)
(15 -6.5625 0.5)
(15 -6.1875 0.5)
(15 -5.8125 0.5)
(15 -5.4375 0.5)
(15 -5.0625 0.5)
(15 -4.6875 0.5)
...
)
;
    }
}


// ************************************************************************* //
