dataset_gen/Earlier_Datasets/OpenFoam_Shapes/Rectangle/design_points/design_point_1/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-8.0159284
-7.76842
-7.5209116
-7.2734032
-7.0258948
-6.7783864
-6.5308779
-6.2833695
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-4.1645143
-4.1145143
-4.0645143
-4.0145143
-3.9645143
-3.9145143
-3.8645143
-3.8145143
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-8.0645143
-7.8145143
-7.5645143
-7.3145143
-7.0645143
-6.8145143
-6.5645143
-6.3145143
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1.6854857
1.4354857
1.1854857
0.93548569
0.68548569
0.43548569
0.18548569
-0.064514308
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform -15;
    }
    Outlet
    {
        type            calculated;
        value           uniform 15;
    }
}


// ************************************************************************* //
